api/minihub/app/controllers/api/companies_controller.rb

  def index
    companies = Company.all
---
SELECT "companies".* FROM "companies"

  def create
    company = Company.new(company_params)
    if company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "New Company"], ["created_at", "2024-10-17 00:46:12.212516"], ["updated_at", "2024-10-17 00:46:12.212516"]]

  def update
    company = Company.update(company_params)
---
UPDATE "companies" SET "name" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["name", "GOV"], ["updated_at", "2024-10-17 09:19:23.659069"], ["id", 1]]