api/minihub/app/controllers/api/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
SELECT "contacts".* FROM "contacts" WHERE "contacts"."company_id" = $1  [["company_id", 1]]
---
    def index
      if @company.present?
        contacts = @company.contacts
      else
        contacts = Contact.all
      end
      contacts_with_company = contacts.map do |contact|

INSERT INTO "contacts" ("name", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sam"], ["company_id", 2], ["created_at", "2024-10-17 09:17:35.895246"], ["updated_at", "2024-10-17 09:17:35.895246"]]
---
    def create
      contact = @company.contacts.new(contact_params)
      if contact.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_company
      return if params[:company_id].blank?

      @company = Company.find(params[:company_id])  # Find the company based on the company_id in the URL