api/minihub/app/controllers/api/interactions_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "interactions".* FROM "interactions" WHERE "interactions"."company_id" = $1  [["company_id", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
    def index
      if @company.present?
        interactions = @company.interactions.includes(:contacts)
      else
        interactions = Interaction.includes(:company, :contacts)
      end

      # Map the interactions to include contact_count
      interactions_with_contact_count = interactions.map do |interaction|

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_company
      return if params[:company_id].blank?

      @company = Company.find(params[:company_id])